RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/inc/hc32_ll_can.h
/**
 *******************************************************************************
 * @file  hc32_ll_can.h
 * @brief This file contains all the functions prototypes of the CAN driver
 *        library.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32_LL_CAN_H__
#define __HC32_LL_CAN_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_def.h"

#include "hc32f4xx.h"
#include "hc32f4xx_conf.h"
/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @addtogroup LL_CAN
 * @{
 */
#if (LL_CAN_ENABLE == DDL_ON)

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup CAN_Global_Types CAN Global Types
 * @{
 */
/**
 * @brief CAN bit time configuration structure.
 * @note 1. TQ = u32Prescaler / CANClock.
 * @note 2. Bit time = (u32TimeSeg2 + u32TimeSeg2) x TQ.
 * @note 3. Baudrate = CANClock/(u32Prescaler*(u32TimeSeg1 + u32TimeSeg2))
 * @note 4. See user manual of the target MCU and ISO11898-1 for more details.
 */
typedef struct {
    uint32_t u32Prescaler;                  /*!< Specifies the prescaler of CAN clock, [1, 256]. */
    uint32_t u32TimeSeg1;                   /*!< Specifies the number of time quanta in Bit Segment 1.
                                                 u32TimeSeg1 Contains synchronization segment,
                                                 propagation time segment and phase buffer segment 1. */
    uint32_t u32TimeSeg2;                   /*!< Specifies the number of time quanta in Bit Segment 2.
                                                 Phase buffer segment 2. */
    uint32_t u32SJW;                        /*!< Synchronization Jump Width.
                                                 Specifies the maximum number of time quanta the CAN hardware
                                                 is allowed to lengthen or shorten a bit to perform resynchronization. */
} stc_can_bit_time_config_t;

/**
 * @brief CAN acceptance filter configuration structure.
 */
typedef struct {
    uint32_t u32ID;                         /*!< Specifies the identifier(ID). 11 bits standard ID or 29 bits extended ID, depending on IDE. */
    uint32_t u32IDMask;                     /*!< Specifies the identifier(ID) mask. The mask bits of ID will be ignored by the acceptance filter. */
    uint32_t u32IDType;                     /*!< Specifies the identifier(ID) type. This parameter can be a value of @ref CAN_ID_Type */
} stc_can_filter_config_t;

/* CAN-FD structure */

/**
 * @brief TTCAN configuration structure.
 */
typedef struct {
    uint32_t u32RefMsgID;                   /*!< Reference message identifier. */
    uint32_t u32RefMsgIDE;                  /*!< Reference message identifier extension bit.
                                                 '1' to set the ID which is specified by parameter 'u32RefMsgID' as an extended ID while
                                                 '0' to set it as a standard ID. */
    uint8_t u8NTUPrescaler;                 /*!< Prescaler of NTU(network time unit). The source is the bit time which is defined by SBT.
                                                 This parameter can be a value of @ref TTCAN_NTU_Prescaler */
    uint8_t u8TxBufMode;                    /*!< TTCAN Transmit Buffer Mode.
                                                 This parameter can be a value of @ref TTCAN_Tx_Buf_Mode */
    uint16_t u16TriggerType;                /*!< Trigger type of TTCAN.
                                                 This parameter can be a value of @ref TTCAN_Trigger_Type */
    uint16_t u16TxEnableWindow;             /*!< Tx_Enable window. Time period within which the transmission of a message may be started. Range is [1, 16] */
    uint16_t u16TxTriggerTime;              /*!< Specifies for the referred message the time window of the matrix cycle at which it is to be transmitted. Range is [0, 65535] */
    uint16_t u16WatchTriggerTime;           /*!< Time mark used to check whether the time since the last valid reference message has been too long. Range is [0, 65535] */
} stc_can_ttc_config_t;

/**
 * @brief CAN initialization structure.
 */
typedef struct {
    stc_can_bit_time_config_t stcBitCfg;    /*!< Bit time configuration of classical CAN bit. @ref stc_can_bit_time_config_t */
    stc_can_filter_config_t *pstcFilter;    /*!< Pointer to a @ref stc_can_filter_config_t structure that
                                                 contains the configuration informations for the acceptance filters. */
    uint16_t u16FilterSelect;               /*!< Selects acceptance filters.
                                                 This parameter can be values of @ref CAN_Acceptance_Filter */
    uint8_t u8WorkMode;                     /*!< Specifies the work mode of CAN.
                                                 This parameter can be a value of @ref CAN_Work_Mode */
    uint8_t u8PTBSingleShotTx;              /*!< Enable or disable single shot transmission of PTB.
                                                 This parameter can be a value of @ref PTB_SingleShot_Tx_En */
    uint8_t u8STBSingleShotTx;              /*!< Enable or disable single shot transmission of STB.
                                                 This parameter can be a value of @ref STB_SingleShot_Tx_En */
    uint8_t u8STBPrioMode;                  /*!< Enable or disable the priority decision mode of STB.
                                                 This parameter can be a value of @ref CAN_STB_Prio_Mode_En
                                                 NOTE: A frame in the PTB has always the highest priority regardless of the ID. */
    uint8_t u8RxWarnLimit;                  /*!< Specifies receive buffer almost full warning limit. Rang is [1, 8].
                                                 Each CAN unit has 8 receive buffers. When the number of received frames reaches
                                                 the value specified by u8RxWarnLimit, register bit RTIF.RAFIF is set and the interrupt occurred
                                                 if it was enabled. */
    uint8_t u8ErrorWarnLimit;               /*!< Specifies programmable error warning limit. Range is [0, 15].
                                                 Error warning limit = (u8ErrorWarnLimit + 1) * 8. */
    uint8_t u8RxAllFrame;                   /*!< Enable or disable receive all frames(includes frames with error).
                                                 This parameter can be a value of @ref CAN_Rx_All_En */
    uint8_t u8RxOvfMode;                    /*!< Receive buffer overflow mode. In case of a full receive buffer when a new frame is received.
                                                 This parameter can be a value of @ref CAN_Rx_Ovf_Mode */
    uint8_t u8SelfAck;                      /*!< Enable or disable self-acknowledge.
                                                 This parameter can be a value of @ref CAN_Self_ACK_En */

